/// <summary>
/// Ася е млада хакерка.
///  От скоро тя се занимава с хакване на двоични пароли.
///  Двоичните пароли са последователности от нули и единици.
///  Ася е все още начинаещ хакер и от скоро тя може да намира части от двоични пароли.
///  За съжаление тези пароли не са пълни и липсващите единици или нули са заместени със звездички.
///  Така се получава една последователност от единици, нули и звездички, които образуват шаблон.
///  Помогнете на Ася да сметне колко са възможните различни пароли, които могат да се образуват от тези шаблони.
///  Всяка звездичка в шаблона може да бъде както единица, така и нула.
/// 01001110	1	Единствената възможна парола е 01001110
/// 1***0	8	Възможните пароли са: 10000, 10010, 10100, 10110, 11000, 11010, 11100, 11110
/// ***101***	64	От този шаблон могат да се получат 64 на брой различни пароли.
/// </summary>

namespace BinaryPasswords
{
    using System;
    using System.Linq;
    using System.Numerics;

    public class Stratup
    {
        public static void Main()
        {
            string input = Console.ReadLine();

            int pow = input.Where(x => x == '*').Count();
            BigInteger combinations = new BigInteger(1);

            for (int i = 0; i < pow; i++)
            {
                combinations *= 2;
            }

            Console.WriteLine(combinations);
        }
    }
}
